[
  {
    "title": "Villa 'nduzienne",
    "url": "https://villaanduze.fr/",
    "github": "https://github.com/Amlac-Eniotna/villaanduze",
    "technologie": ["HTML", "Sass", "Javascript"],
    "date": "06/2024",
    "image": "/projects/villa-anduze.png",
    "description": "Site vitrine pour une villa de vacances en Cévennes, entièrement développé en HTML, JavaScript et Sass. Interface moderne et responsive construite de zéro avec du CSS préprocessé et des interactions JavaScript natives. Avec le recul, j'opterais aujourd'hui pour un framework comme NextJS afin d'optimiser ma productivité et de générer directement un site statique."
  },
  {
    "title": "Responsive IMG",
    "url": "https://responsive-img.antoinecalma.fr/",
    "github": "https://github.com/Amlac-Eniotna/responsive_img",
    "technologie": ["NextJS", "Redux", "Typescript"],
    "date": "06/2024",
    "image": "/projects/responsive-img.png",
    "description": "Outil de génération d'images optimisées au format WebP à différentes échelles pour le responsive. Interface intuitive développée avec NextJS, Redux et TypeScript. Génération automatique de multiples résolutions à partir d'une image source. Note : il y a un manque d'optimisation lors du traitement de nombreuses images haute résolution car je n'ai pas utilisé de solution de mise en cache lors de la génération des images."
  },
  {
    "title": "GBE Solution",
    "url": "https://gbesolution.fr/",
    "technologie": ["NextJS", "nodemailer", "Typescript"],
    "date": "09/2024",
    "image": "/projects/gbe-solution.png",
    "description": "Site corporate développé avec NextJS pour une entreprise de solutions techniques. Animations fluides avec framer-motion et formulaire de contact intelligent avec envoi automatique d'emails via nodemailer. Développement assisté par IA pour optimiser l'architecture et l'expérience utilisateur."
  },
  {
    "title": "Maquette IzyCar",
    "url": "https://www.figma.com/design/ikUBrKzSRAl4dn8Ai2hVIF/Izycar?node-id=0-1&t=bI64cyQVMFNY18Df-1",
    "technologie": ["Affinity Design"],
    "date": "10/2024",
    "image": "/projects/izycar-mockup.png",
    "description": "Maquette UX/UI complète pour une application mobile de location de voiture. Design system cohérent réalisé avec Affinity Designer. Avec le recul, j'opterais pour Figma afin de bénéficier d'outils de prototypage interactif plus adaptés au design d'interfaces."
  },
  {
    "title": "Femmes en cévennes",
    "url": "https://femmes-en-cevennes.fr/",
    "github": "https://github.com/Amlac-Eniotna/femmes_en_cevennes",
    "technologie": ["NextJS", "NextAuth"],
    "date": "10/2024",
    "image": "/projects/femmes-cevennes.png",
    "description": "Plateforme communautaire développée bénévolement pour une association locale. Cette solution permet aux responsables de créer facilement des annonces visuelles en ligne, offrant une alternative autonome aux plateformes de messagerie traditionnelles. Intègre un système d'authentification sécurisé via NextAuth, permettant une gestion de contenu intuitive : les responsables peuvent publier des annonces et les membres consulter les informations de manière indépendante."
  },
  {
    "title": "GBE Rénov'",
    "url": "https://gberenov.fr/",
    "technologie": ["NextJS", "nodemailer", "Typescript"],
    "date": "11/2024",
    "image": "/projects/gbe-renov.png",
    "description": "Site vitrine professionnel pour une entreprise de rénovation et petits travaux en Essonne. Interface moderne avec un blog optimisé SEO pour améliorer la visibilité locale."
  },
  {
    "title": "MaisonSinistrée.fr",
    "url": "https://maisonsinistree.fr/",
    "technologie": ["NextJS", "nodemailer", "Typescript"],
    "date": "12/2024",
    "image": "/projects/maison-sinistree.png",
    "description": "Site d'une société spécialisée dans le rachat de biens immobiliers pour les victimes de sinistres non indemnisées. Interface optimisée pour présenter les services de rachat rapide avec processus d'évaluation en ligne. Approche UX empathique développée à partir de wireframes puis maquette détaillée pour accompagner les propriétaires en difficulté."
  },
  {
    "title": "Archikeo",
    "url": "https://archikeo.fr/",
    "technologie": ["NextJS", "nodemailer", "ClaudeAI"],
    "date": "05/2025",
    "image": "/projects/archikeo.png",
    "description": "Archikeo, cabinet d’expertise d’assurés dédié à la défense des victimes face aux assurances. Développé avec Next.js et un formulaire NodeMailer, il allie performance, sécurité et fiabilité au service de ses clients."
  }
]
